# Pandas Basic Practise(1929121_Soumayan)

**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [2]:
import pandas as pd
import numpy as np

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
    'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
    'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

data['labels'] = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, columns=['birds', 'age', 'visits', 'priority', 'labels'])
df.set_index('labels')

             birds  age  visits priority
labels
a           Cranes  3.5       2      yes
b           Cranes  4.0       4      yes
c          plovers  1.5       3       no
d       spoonbills  NaN       4      yes
e       spoonbills  6.0       3       no
f           Cranes  3.0       4       no
g          plovers  5.5       2       no
h           Cranes  NaN       2      yes
i       spoonbills  8.0       3       no
j       spoonbills  4.0       2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
 4   labels    10 non-null     object
dtypes: float64(1), int64(1), object(3)
memory usage: 528.0+ bytes

In [5]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [7]:
df.head(2)

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
1  Cranes  4.0       4      yes      b

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [11]:
df.drop(['visits','priority','labels'],axis=1)

        birds  age
0      Cranes  3.5
1      Cranes  4.0
2     plovers  1.5
3  spoonbills  NaN
4  spoonbills  6.0
5      Cranes  3.0
6     plovers  5.5
7      Cranes  NaN
8  spoonbills  8.0
9  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [14]:
df1 = df.drop(['priority','labels'],axis=1)
df1.iloc[[2, 3, 7]]

        birds  age  visits
2     plovers  1.5       3
3  spoonbills  NaN       4
7      Cranes  NaN       2

**6. select the rows where the number of visits is less than 4**

In [18]:
df[df['visits'] < 4]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
2     plovers  1.5       3       no      c
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [33]:
df2 = df.drop(['priority','labels'],axis=1)

df2[df2['age'].isnull()]

        birds  age  visits
3  spoonbills  NaN       4
7      Cranes  NaN       2

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [34]:
df[(df['birds'] == 'Cranes') & (df['age'] < 4)]

    birds  age  visits priority labels
0  Cranes  3.5       2      yes      a
5  Cranes  3.0       4       no      f

**9. Select the rows the age is between 2 and 4(inclusive)**

In [35]:
df[df['age'].between(2, 4)]

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
5      Cranes  3.0       4       no      f
9  spoonbills  4.0       2       no      j

**10. Find the total number of visits of the bird Cranes**

In [46]:
df[df['birds']=='Cranes']['visits'].sum()

12

**11. Calculate the mean age for each different birds in dataframe.**

In [48]:
print('Cranes : ',df[df['birds']=='Cranes']['age'].mean())
print('Plovers : ',df[df['birds']=='plovers']['age'].mean())
print('Spoonbills : ',df[df['birds']=='spoonbills']['age'].mean())

Cranes :  3.5
Plovers :  3.5
Spoonbills :  6.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [55]:
df.loc['k']=['robin',6.5,4,'yes','i']
df

        birds  age  visits priority labels
0      Cranes  3.5       2      yes      a
1      Cranes  4.0       4      yes      b
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
4  spoonbills  6.0       3       no      e
5      Cranes  3.0       4       no      f
6     plovers  5.5       2       no      g
7      Cranes  NaN       2      yes      h
8  spoonbills  8.0       3       no      i
9  spoonbills  4.0       2       no      j
k       robin  6.5       4      yes      i

**13. Find the number of each type of birds in dataframe (Counts)**

In [56]:
df.groupby('birds').count()

            age  visits  priority  labels
birds
Cranes        3       4         4       4
plovers       2       2         2       2
robin         1       1         1       1
spoonbills    3       4         4       4

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [57]:
df.sort_values(by='age',ascending=False)

        birds  age  visits priority labels
8  spoonbills  8.0       3       no      i
k       robin  6.5       4      yes      i
4  spoonbills  6.0       3       no      e
6     plovers  5.5       2       no      g
1      Cranes  4.0       4      yes      b
9  spoonbills  4.0       2       no      j
0      Cranes  3.5       2      yes      a
5      Cranes  3.0       4       no      f
2     plovers  1.5       3       no      c
3  spoonbills  NaN       4      yes      d
7      Cranes  NaN       2      yes      h

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [58]:
df['priority']=df['priority'].replace(['yes','no'],[1,0]) 
df

        birds  age  visits  priority labels
0      Cranes  3.5       2         1      a
1      Cranes  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5      Cranes  3.0       4         0      f
6     plovers  5.5       2         0      g
7      Cranes  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j
k       robin  6.5       4         1      i

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [60]:
df['birds']=df['birds'].replace(['Cranes'],'trumpeters') 
df

        birds  age  visits  priority labels
0  trumpeters  3.5       2         1      a
1  trumpeters  4.0       4         1      b
2     plovers  1.5       3         0      c
3  spoonbills  NaN       4         1      d
4  spoonbills  6.0       3         0      e
5  trumpeters  3.0       4         0      f
6     plovers  5.5       2         0      g
7  trumpeters  NaN       2         1      h
8  spoonbills  8.0       3         0      i
9  spoonbills  4.0       2         0      j
k       robin  6.5       4         1      i